/*
** $ 身份：嘞操作码名字.h $
**操作码名称
**请参见lua.h中的版权声明
*
** 本人所用声母表: a啊 b哔 c西 d迪 e鹅 f弗 g哥 
* h喝 i艾 j鸡 k颗 l嘞 m摸 n恩
* o欧 p匹 q气 r日 s丝 t嚏 
* u由 v微 w屋 x斯 y医 z只
*
* 一些英文单词缩写,我的翻译大多来自;有道词典,谷歌翻译,百度.
* 一些术语实在不好翻译,所以就原封不动.
* 
* 
*/

#if !defined(嘞操作码名字_喝)
#define 嘞操作码名字_喝

#include <stddef.h>

/* 秩序 操作 */
static const char *const 操作码名字[] = {
  "移",
  "载整数",
  "载浮点",
  "载常量",
  "载常量斯",
  "载假",
  "嘞假跳过",
  "载真",
  "载无",
  "取上值",
  "设置上值",
  "取表上",
  "取表",
  "取整数",
  "取字段",
  "设置表上",
  "设置表",
  "设置整数",
  "设置字段",
  "新表",
  "自己",
  "加整数",
  "加常量",
  "减常量",
  "乘常量",
  "余数常量",
  "幂常量",
  "除常量",
  "符号除常量",
  "位与常量",
  "位或常量",
  "位异或常量",
  "右移整数",
  "左移整数",
  "加",
  "减",
  "乘",
  "余数",
  "幂",
  "除",
  "符号除",
  "位与",
  "位或",
  "位异或",
  "左移",
  "右移",
  "元方法索引",
  "元方法索引整数",
  "元方法索引常量",
  "负",
  "位非",
  "非",
  "长度",
  "连接",
  "关闭",
  "待关闭",
  "跳",
  "等于",
  "小于",
  "小等",
  "等于常量",
  "等于整数",
  "小于整数",
  "小等整数",
  "大于整数",
  "大等整数",
  "测试",
  "测试设置",
  "调用",
  "尾调用",
  "返回",
  "返回0",
  "返回1",
  "为环",
  "为预备",
  "嚏为预备",
  "嚏为调用",
  "嚏为环",
  "设置列表",
  "闭包",
  "变参",
  "变参预备",
  "额外参",
  NULL
};

#endif