/*
** $ 身份：嘞跳转表.h $
** 炉啊解释器的跳转表
** 请参见炉啊.h中的版权声明
*
* 本人所用声母表: a啊 b哔 c西 d迪 e鹅 f弗 g哥 
* h喝 i艾 j鸡 k颗 l嘞 m摸 n恩
* o欧 p匹 q气 r日 s丝 t嚏 
* u由 v微 w屋 x斯 y医 z只
*
* 一些英文单词缩写,我的翻译大多来自;有道词典,谷歌翻译,百度.
* 一些术语实在不好翻译,所以就原封不动.
* 
*/

#undef 虚拟机器调度
#undef 虚拟机器情况
#undef 虚拟机器断开

#define 虚拟机器调度(斯)     goto *调度表[斯];

#define 虚拟机器情况(嘞)     嘞_##嘞:

#define 虚拟机器断开		虚拟机器拾取(); 虚拟机器调度(取_操作码(艾));

static const void *const 调度表[号码_操作码] = {

#if 0
** 您可以使用此命令更新以下列表：
**
** 流编辑 -恩 '/^OP_/\!d; s/OP_/\&\&L_OP_/ ; s/,.*/,/ ; s/\/.*// ; p'  嘞操作码.h
**
#endif

&&嘞_操作_移,
&&嘞_操作_载整数,
&&嘞_操作_载浮点,
&&嘞_操作_载常量,
&&嘞_操作_载常量斯,
&&嘞_操作_载假,
&&嘞_操作_嘞假跳过,
&&嘞_操作_载真,
&&嘞_操作_载无,
&&嘞_操作_取上值,
&&嘞_操作_设置上值,
&&嘞_操作_取表上,
&&嘞_操作_取表小等,
&&嘞_操作_取整数,
&&嘞_操作_取字段,
&&嘞_操作_设置表上,
&&嘞_操作_设置表,
&&嘞_操作_设置整数,
&&嘞_操作_设置字段,
&&嘞_操作_新表,
&&嘞_操作_自我,
&&嘞_操作_加整数,
&&嘞_操作_加常量,
&&嘞_操作_减常量,
&&嘞_操作_乘常量,
&&嘞_操作_余数常量,
&&嘞_操作_幂常量,
&&嘞_操作_除常量,
&&嘞_操作_符号除常量,
&&嘞_操作_位与常量,
&&嘞_操作_位或常量,
&&嘞_操作_位异或常量,
&&嘞_操作_右移整数,
&&嘞_操作_左移整数,
&&嘞_操作_加,
&&嘞_操作_减,
&&嘞_操作_乘,
&&嘞_操作_余数,
&&嘞_操作_幂,
&&嘞_操作_除,
&&嘞_操作_符号除,
&&嘞_操作_位与,
&&嘞_操作_位或,
&&嘞_操作_位异或,
&&嘞_操作_左移,
&&嘞_操作_右移,
&&嘞_操作_元方法索引,
&&嘞_操作_元方法索引整数,
&&嘞_操作_元方法索引常量,
&&嘞_操作_负,
&&嘞_操作_位非,
&&嘞_操作_非,
&&嘞_操作_长度,
&&嘞_操作_连接,
&&嘞_操作_关闭,
&&嘞_操作_待关闭,
&&嘞_操作_跳,
&&嘞_操作_等于,
&&嘞_操作_小于,
&&嘞_操作_小等,
&&嘞_操作_等于常量,
&&嘞_操作_等于整数,
&&嘞_操作_小于整数,
&&嘞_操作_小等整数,
&&嘞_操作_大于整数,
&&嘞_操作_大等整数,
&&嘞_操作_测试,
&&嘞_操作_测试设置,
&&嘞_操作_调用,
&&嘞_操作_尾调用,
&&嘞_操作_返回,
&&嘞_操作_返回0,
&&嘞_操作_返回1,
&&嘞_操作_为环,
&&嘞_操作_为预备,
&&嘞_操作_嚏为预备,
&&嘞_操作_嚏为调用,
&&嘞_操作_嚏为环,
&&嘞_操作_设置列表,
&&嘞_操作_闭包,
&&嘞_操作_变参,
&&嘞_操作_变参预备,
&&嘞_操作_额外参

};