/*
** $ 身份：炉啊库.h $
** 炉啊标准库
**请参见炉啊.h中的版权声明
*/

#ifndef 炉啊库_喝
#define 炉啊库_喝

#include "炉啊.h"

/* 环境变量名称的版本后缀 */
#define 炉啊_版本后缀          "_" 炉啊_版本_少校 "_" 炉啊_版本_辅修

炉啊模_应用程序接口 int (炉啊开_基础) (炉啊_国 *嘞);

#define 炉啊_协程库名	"协程"
炉啊模_应用程序接口 int (炉啊开_协程) (炉啊_国 *嘞);

#define 炉啊_表库名	"表"
炉啊模_应用程序接口 int (炉啊开_表) (炉啊_国 *嘞);

#define 炉啊_入出库名	"入出"
炉啊模_应用程序接口 int (炉啊开_入出) (炉啊_国 *嘞);

#define 炉啊_操作系统库名	"操作系统"
炉啊模_应用程序接口 int (炉啊开_操作系统) (炉啊_国 *嘞);

#define 炉啊_串库名	"串"
炉啊模_应用程序接口 int (炉啊开_串) (炉啊_国 *嘞);

#define 炉啊_UTF8库名	"utf8"
炉啊模_应用程序接口 int (炉啊开_utf8) (炉啊_国 *嘞);

#define 炉啊_数学库名	"数学"
炉啊模_应用程序接口 int (炉啊开_数学) (炉啊_国 *嘞);

#define 炉啊_调试库名	"调试"
炉啊模_应用程序接口 int (炉啊开_调试) (炉啊_国 *嘞);

#define 炉啊_载入库名	"包"
炉啊模_应用程序接口 int (炉啊开_包) (炉啊_国 *嘞);

/* 打开所有以前的库 */

炉啊库_应用程序接口 void (炉啊嘞_开库) (炉啊_国 *嘞);

#if !defined(炉啊_断言)
#define 炉啊_断言(斯)	((void)0)
#endif


#endif